Autodesk.Revit.DB.Structure.MemberForces.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.MemberForces.Moment
The rotational forces at relative point position of the element.
Remarks:
The x value of XYZ object represents moment about x-axis of the analytical model coordinate system, y about y-axis, z about z-axis respectively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.MemberForces.Force
The translational forces at relative point position of the element.
Remarks:
The x value of XYZ object represents moment about x-axis of the analytical model coordinate system, y about y-axis, z about z-axis respectively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.MemberForces.Start
Member Forces position on analytical model stick element. True for start, false for end.
Since:
2016

Autodesk.Revit.DB.Structure.MemberForces.#ctor(System.Boolean,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new instance of MemberForces.
start:
Member Forces position on analytical model stick element. True for start, false for end.
force:
The Translational forces at specified position of the element.
The x value of XYZ object represents force along x-axis of the analytical model coordinate system, y along y-axis, z along z-axis respectively.
moment:
The Rotational forces at specified position of the element.
The x value of XYZ object represents moment about x-axis of the analytical model coordinate system, y about y-axis, z about z-axis respectively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.MemberForces
An object that represents a member forces on analytical model element.
Since:
2016